app/Http/ViewComposers/FooterComposer.php

select * from `settings` where `is_active` = '1' order by `created_at` desc
---
    public function compose(View $view)
    {
        $settings = $this->setting->where('is_active','1')->orderBy('created_at','desc')->get();