app/Helper/Helper.php

    public static function isGateSurpassed($module_alias, $action){
        $access = Helper::resetCollectionFirstArrayInstanceGetRole((auth('admin')->user()->adminType->access)->groupBy('module_id'));
        $module_ids = $access->keys()->toArray();
        $module_alias_array = Module::whereIn('id', $module_ids)->pluck('id', 'alias')->toArray();
---
select * from `admin_types` where `admin_types`.`id` = 1 limit 1
select `id`, `alias` from `modules` where `id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16)