app/Http/ViewComposers/Frontend/AppComposer.php

select * from `settings` where `is_active` = '1'
select * from `contents` where `slug` = 'about-us' limit 1
select * from `contents` where `is_active` = '1' and `display_in` = 'footer'
---
    public function compose(view $view){

       $settings = $this->setting->where('is_active','1')->get();
        $about = $this->content->where('slug','about-us')->first();
        $footermenu = $this->content->where('is_active','1')->where('display_in','footer')->get();