app/Http/ViewComposers/Frontend/BlogComposer.php

select * from `blog` where `is_active` = '1' order by `created_at` desc limit 3
select * from `blog` where `is_active` = '1' order by `created_at` desc limit 4
select * from `event` where `is_active` = '1' order by `created_at` desc limit 4
select * from `member` where `type` = 'Executive' and year(`created_at`) = '2020' order by `display_order` asc limit 3
select * from `contents` where `is_active` = '1' and `display_in` = 'content'
select * from `contents` where `slug` = 'about-us' limit 1
select * from `galleries` where `is_active` = '1' and `galleries`.`deleted_at` is null order by `created_at` desc limit 8
select * from `banners` where `is_active` = '1' order by `created_at` desc limit 4
---
    public function compose(view $view){
        $blogs = $this->blog->where('is_active','1')->latest()->take(3)->get();
        $sidebarblogs = $this->blog->where('is_active','1')->latest()->take(4)->get();
        $events = $this->event->where('is_active','1')->latest()->take(4)->get();


        $year = Carbon::now()->format('Y');
        $members = $this->member->where('type','Executive')->whereYear('created_at',$year)->orderBy('display_order','asc')->take(3)->get();

        $contents = $this->content->where('is_active','1')->where('display_in','content')->get();

        $about = $this->content->where('slug','about-us')->first();

        $galleries = $this->gallery->where('is_active','1')->latest()->take(8)->get();
        $banners = $this->banner->where('is_active','1')->latest()->take(4)->get();