app/Http/ViewComposers/Frontend/FooterComposer.php

select * from `settings` where `is_active` = '1' order by `created_at` desc
select * from `contents` where `is_active` = '1' and `display_in` = 'header'
select * from `contents` where `is_active` = '1' and `display_in` = 'footer' order by `created_at` desc limit 5
select * from `contents` where `is_active` = '1' and `display_in` = 'footer' order by `created_at` desc limit 10 offset 5
select * from `contents` where `title` = 'About Us' limit 1
---
    public function compose(view $view){
        $settings = $this->setting->where('is_active', '1')->orderBy('created_at','desc')->get();
        $contents = $this->content->where('is_active', '1')->where('display_in','header')->get();
        $latestcontents = $this->content->where('is_active','1')->where('display_in','footer')->latest()->take(5)->get();

        $contentmenus = $this->content->where('is_active', '1')->where('display_in','footer')->latest()->take(10)->skip(5)->get();
        $about = $this->content->where('title','About Us')->first();