app/Http/ViewComposers/Frontend/SidebarComposer.php

    public function compose(view $view){
        $news = $this->news->where('is_active','1')->where('type','1')->latest()->take(4)->get();
        $galleries = $this->gallery->where('is_active','1')->latest()->take(6)->get();
---
select * from `galleries` where `is_active` = '1' and `galleries`.`deleted_at` is null order by `created_at` desc limit 6