app/Http/Controllers/BlogController.php

    public function index(){
        $setting = $this->setting->where('slug','banner-image')->first();

        $blogs = $this->blog->where('is_active','1')->orderBy('created_at','desc')->paginate(6);
---
select * from `settings` where `slug` = 'banner-image' limit 1
select * from `blog` where `is_active` = '1' order by `created_at` desc limit 6 offset 0
select count(*) as aggregate from `blog` where `is_active` = '1'

    public function show($slug){
        $setting = $this->setting->where('slug','banner-image')->first();

        $blog = $this->blog->where('slug',$slug)->first();
---
select * from `settings` where `slug` = 'banner-image' limit 1
select * from `blog` where `slug` = 'architecto-nemo-assu' limit 1