app/Http/Controllers/ContactController.php

    public function index(){
        $setting = $this->setting->where('slug','banner-image')->first();
---
select * from `settings` where `slug` = 'banner-image' limit 1