app/Http/Controllers/ContentController.php

select * from `settings` where `slug` = 'banner-image' limit 1
select * from `contents` where `is_active` = '1' and `slug` = 'khas-history' limit 1
---
    public function show($slug){

        $setting = $this->setting->where('slug','banner-image')->first();

        $content = $this->content->where('is_active','1')->where('slug', $slug)->first();