app/Http/Controllers/EventController.php

    public function index()
    {
        $setting = $this->setting->where('slug','banner-image')->first();
        $events = $this->event->where('is_active','1')->orderBy('created_at','desc')->paginate(8);
---
select * from `settings` where `slug` = 'banner-image' limit 1
select * from `event` where `is_active` = '1' order by `created_at` desc limit 8 offset 0
select count(*) as aggregate from `event` where `is_active` = '1'

    public function show($slug)
    {
        $setting = $this->setting->where('slug','banner-image')->first();

        $event = $this->event->where('slug',$slug)->where('is_active','1')->first();
        $events = $this->event->where('is_active','1')->get();
---
select * from `settings` where `slug` = 'banner-image' limit 1
select * from `event` where `slug` = 'optio-saepe-ex-nemo' and `is_active` = '1' limit 1
select * from `event` where `is_active` = '1'