app/Http/Controllers/GalleryController.php

    public function index(){
        $setting = $this->setting->where('slug','banner-image')->first();
        $galleries =$this->gallery->where('is_active','1')->paginate(9);
---
select * from `settings` where `slug` = 'banner-image' limit 1
select * from `galleries` where `is_active` = '1' and `galleries`.`deleted_at` is null limit 9 offset 0
select count(*) as aggregate from `galleries` where `is_active` = '1' and `galleries`.`deleted_at` is null

    public function show($slug){
        $gallery =$this->gallery->where('slug',$slug)->first();
        $galleryImages = $this->galleryImage->where('gallery_id',$gallery->id)->orderby('created_at','desc')->paginate(9);
        $setting = $this->setting->where('slug','banner-image')->first();
---
select * from `galleries` where `slug` = 'this-is-third-gallery2' and `galleries`.`deleted_at` is null limit 1
select count(*) as aggregate from `gallery_images` where `gallery_id` = 9 and `gallery_images`.`deleted_at` is null
select * from `settings` where `slug` = 'banner-image' limit 1