app/Http/Controllers/MemberController.php

select * from `settings` where `slug` = 'banner-image' limit 1
select * from `member` where `is_active` = '1' and `type` = 'Member' order by `display_order` asc limit 9 offset 0
select count(*) as aggregate from `member` where `is_active` = '1' and `type` = 'Member'
---
    public function index(){
        $setting = $this->setting->where('slug','banner-image')->first();

        $members = $this->member->where('is_active','1')->where('type','Member')->orderBy('display_order','asc')->paginate(9);