app/Http/Controllers/TeamController.php

    public function index(){

        $year = Carbon::now()->format('Y');
        $executives = $this->member->where('type','Executive')->whereYear('created_at',$year)->orderBy('display_order','asc')->get();

        $members = $this->member->where('type','Member')->orderBy('display_order','asc')->get();
        $setting = $this->setting->where('slug','banner-image')->first();

        $usersUnique = Members::select(DB::raw('count(id) as `created_at`'), DB::raw("DATE_FORMAT(created_at, '%Y') new_date"),  DB::raw('YEAR(created_at) year, MONTH(created_at) year'))
            ->groupby('created_at','year')
            ->where('is_active','1')
            ->orderBy('created_at','desc')
            ->get();
---
select * from `member` where `type` = 'Executive' and year(`created_at`) = '2020' order by `display_order` asc
select * from `member` where `type` = 'Member' order by `display_order` asc
select * from `settings` where `slug` = 'banner-image' limit 1
select count(id) as `created_at`, DATE_FORMAT(created_at, '%Y') new_date, YEAR(created_at) year, MONTH(created_at) year from `member` where `is_active` = '1' group by `created_at`, `year` order by `created_at` desc

    public  function list(Request $request){

        $executives = $this->member->where('type','Executive')->whereYear('created_at',$request->date)->orderBy('display_order','asc')->get();
---
select * from `member` where `type` = 'Executive' and year(`created_at`) = '2019' order by `display_order` asc