app/Http/Controllers/Admin/AdminAccessController.php

    public function store($adminTypeId, Request $request)
    {
        $old_data = $this->adminAccess->where('admin_type_id', $adminTypeId)->get();

        $modules = $this->module->model()->pluck('id')->toArray();
---
select * from `admin_accesses` where `admin_type_id` = '1'
select `id` from `modules`

        }


        $this->adminAccess->model()->where('admin_type_id', $adminTypeId)->delete();

        try{
            $this->adminAccess->model()->insert($new_access);
---
delete from `admin_accesses` where `admin_type_id` = '1'
insert into `admin_accesses` (`add`, `admin_type_id`, `changeStatus`, `delete`, `edit`, `module_id`, `view`) values (1, '1', 1, 1, 1, 1, 1), (1, '1', 1, 1, 1, 2, 1), (1, '1', 1, 1, 1, 3, 1), (1, '1', 1, 1, 1, 4, 1), (1, '1', 1, 1, 1, 5, 1), (1, '1', 1, 1, 1, 6, 1), (1, '1', 1, 1, 1, 7, 1), (1, '1', 1, 1, 1, 8, 1), (1, '1', 1, 1, 1, 9, 1), (1, '1', 1, 1, 1, 10, 1), (1, '1', 1, 1, 1, 11, 1), (1, '1', 1, 1, 1, 12, 1)