app/Http/Controllers/Admin/BlogController.php

select * from `blog` order by `created_at` desc limit 100 offset 0
select count(*) as aggregate from `blog`
---
    public function index(Request $request)
    {
        auth()->user()->can('master-policy.perform',['blog', 'view']);
        $title = $this->title;
        $perpage ='100';
        $blogs = $this->blog->orderBy('created_at','desc')->paginate($perpage);