app/Http/Controllers/Admin/ContentController.php

select count(*) as aggregate from `contents`
---
    public function index()
    {
        auth()->user()->can('master-policy.perform', ['content', 'view']);
        $title = $this->title;
        $contents = $this->content->orderBy('created_at', 'desc')->paginate('20');

select * from `contents` where `parent_id` is null and `display_in` = 'header' order by `display_order` asc
---
    public function create()
    {
        auth()->user()->can('master-policy.perform', ['content', 'add']);
        $title = 'Add Content';
        $parents = $this->content->whereNull('parent_id')->orderBy('display_order','asc')->where('display_in','header')->get();

select * from `contents` where `slug` = 'our-aims' limit 1
select * from `contents` where `display_in` = 'header' and `id` != 'our-aims' and `parent_id` is null
---
    public function edit($id)
    {
        auth()->user()->can('master-policy.perform', ['content', 'edit']);
        $title = 'Edit Content';
        $content = $this->content->where('slug',$id)->first();
//        $parents = $this->content->where('id', '!=', $id)->orwhereHas('child', function($query) use($id){
//
//        })->get();
        $patenr= $this->content->where('display_in','header')->where('id', '!=', $id)->with('allchild')->whereNull('parent_id')->get();