app/Http/Controllers/Admin/EventController.php

select * from `event` order by `created_at` desc limit 100 offset 0
select count(*) as aggregate from `event`
---
    public function index(){

        auth()->user()->can('master-policy.perform', ['event', 'view']);
        $events = $this->event->OrderBy('created_at','desc')->paginate('100');