app/Http/Controllers/Admin/GalleryController.php

select * from `galleries` where `galleries`.`deleted_at` is null order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `galleries` where `galleries`.`deleted_at` is null
---
    public function index()
    {
        auth()->user()->can('master-policy.perform',['gallery','view']);
        $title = $this->title;


        $galleries = $this->gallery->orderBy('created_at', 'desc')->paginate('20');