app/Http/Controllers/Admin/MemberTypeController.php

select * from `member_type` order by `display_order` asc limit 20 offset 0
select count(*) as aggregate from `member_type`
---
    public function index(){

        auth()->user()->can('master-policy.perform', ['member-type', 'view']);
        $membersType = $this->memberType->orderBy('display_order', 'asc')->paginate('20');