app/Http/Controllers/Admin/MembersController.php

    public function index()
    {

        auth()->user()->can('master-policy.perform', ['members', 'view']);
      $members = $this->members->orderBy('display_order', 'asc')->paginate('10');;
---
select * from `member` order by created_at, `display_order` asc limit 10 offset 0
select count(*) as aggregate from `member`