app/Http/Controllers/Admin/ModuleController.php

select * from `modules` order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `modules`
---
    public function index()
    {
        $modules = $this->module->orderBy('created_at','desc')->paginate(20);